#+TITLE: midi or CV from 3d mouse
# Tags #music
:PROPERTIES:
:ATTACH_DIR: /Users/iain/Dropbox/org-mode/NotationalVelocity/2503201124 midi or CV from 3d mouse-images
:END:
** Sending midi from python

[[https://pypi.org/project/mido/][Mido]] Seems to be the best option. Maybe Not, opening a port fails with *AttributeError: module 'rtmidi' has no attribute 'API_UNSPECIFIED'* Try something else.
[[https://github.com/patrickkidd/pyrtmidi][PyRtMidi]] saw the current ports on first try.

This will open a port and read any notes or cc messages.
#+begin_src python
import rtmidi

midiin = rtmidi.RtMidiIn()

def print_message(midi):
    if midi.isNoteOn():
        print('ON: ', midi.getMidiNoteName(midi.getNoteNumber()), midi.getVelocity())
    elif midi.isNoteOff():
        print('OFF:', midi.getMidiNoteName(midi.getNoteNumber()))
    elif midi.isController():
        print('CONTROLLER', midi.getControllerNumber(), midi.getControllerValue())

ports = range(midiin.getPortCount())
if ports:
    for i in ports:
        print(f"{i}: {midiin.getPortName(i)}")
    port_number = int(input('enter port number '))
    print(f"Opening {midiin.getPortName(port_number)}") 
    midiin.openPort(port_number)
    while True:
        m = midiin.getMessage(250) # some timeout in ms
        if m:
            print_message(m)
else:
    print('NO MIDI INPUT PORTS!')
#+end_src

List output ports:
#+begin_src python :results output
import rtmidi
midiout = rtmidi.RtMidiOut()
ports = range(midiout.getPortCount())
for i in ports:
    print(f"{i}: {midiout.getPortName(i)}")
#+end_src

#+RESULTS:
: 0: Network Session 1
: 1: nanoKEY CTRL
: 2: MiniFuse 2

Send a test message to Port0, observe with *MidiMonitor*
#+begin_src python
  import rtmidi
  midiout = rtmidi.RtMidiOut()
  testmessage = rtmidi.MidiMessage.noteOn(1,100,120)
  bendmessage = rtmidi.MidiMessage.pitchWheel(1,8192)
  midiout.openPort(0)
  midiout.sendMessage(testmessage)
  midiout.sendMessage(bendmessage)
  return (bendmessage)
#+end_src
#+RESULTS:
: <PITCH WHEEL: value: 8192, channel: 1>
The second paramater for pitchWheel seems to be 0-16383 giving a range of -8192 to 8191 with 8192 giving 0
First parameter is the midi channel.

#+begin_src python
import sys
return sys.version
#+end_src

#+RESULTS:
: 3.11.11 (main, Dec  3 2024, 17:20:40) [Clang 16.0.0 (clang-1600.0.26.4)]

